# Yandex algorithms

_Disclamer_: сильному не нужно, а слабому не поможет.

Небольшая библиотека для помощи в отладке своего решения. Не требует сторонних библиотек. Использует unittest. Код пишется так, как будет сдаваться в контест. При запуске через библиотеку в ввод/вывод подставляются данные из входных файлов, затем сравниваются с ответами.

Данные подставляются:
- в sys.stdin, <имя модуля>.stdin, input()
- во временный файл, при этом меняется значение переменной <имя_модуля>.\<inputfilevar\>. (при чтении имя файла необходимо объявить глобально в переменную, название которой хранится в конфиге)

Вывод считывается:
- из sys.stdout, <имя модуля>.stdin, print()
- из временного файла, при этом меняется значение переменной <имя_модуля>.\<oututfilevar\>. (при чтении имя файла необходимо объявить глобально в переменную, название которой хранится в конфиге)

# Использование
Каталог подразумевает определенную структуру
```<contest_folder>
├── attempts # опционально, для ошибочных решений
│   ├── A_MLE_1.py
│   ├── ...
│   └── C_TLE_1.py
├── inputs # файлы для тестирования
│   ├── A
│   ├── B
│   ├── ...
│   └── ZZ
├── .cfg # файл конфигурации
├── conftest.py # файл с параметрами запуска тестов и функциями
├── A.py # решение первого задания
├── B.py # решение второго задания
... # ещё решения
```
Решение должно содержать функцию `main` и использовать конструкцию `if __name__ == '__main__'` для запуска.

Входные файлы обязательно находятся в папке inputs. Файл с входными данными имеет следующую структуру:
1. Начало входных данных обозначается через промпт (по умолчанию _"-->"_). В этой же строке можно через опцию "-f" указать имя файла, из которого нужно прочитать данные (например, полученные от бота), тогда п.2 не нужен.
2. Входные данные (копируются из контеста).
3. Начало выходных данных обозначается через промпт (по умолчанию _"<--"_). В этой же строке можно через опцию "-f" указать имя файла, из которого нужно прочитать данные (например, полученные от бота), тогда п.4 не нужен
4. Выходные данные (копируются из контеста)
5. Пустая строка в конце файла (в любом случае добавится)

## Установка
`pip install git+https://github.com/MaksM89/yandex-algorithms.git`
## Инициализация
`yalgo init --help`

Создаст необходимую структуру каталога.
Пример: `yalgo init -t <количество задач>`

## Проверка решения
Через консоль (без отладки): `yalgo run --help`

Чтобы использовать возможность отладки (F5, F10 и т.п.), необходимо настроить IDE на запуск модуля _yandex_algorithms_ с параметром run. Инструкция для [vscode](https://code.visualstudio.com/docs/python/python-tutorial#_configure-and-run-the-debugger), [pycharm](https://www.jetbrains.com/help/pycharm/run-debug-configuration.html#createExplicitly). Далее в conftest.py задать переменные _taskname_ (если не задать, будет использоваться последний модифицированный файл) и _testnum_ (None - все тесты). Далее можно запускать отладку в этой конфигурации как обычно.


Пример для запуска 3 теста задачи B: `yalgo run -t 3 B`

### Задание функции для сравнения ответов
По умолчанию вывод решения сравнивается с записанным в файл как текст. Иногда бывает полезно изменить это поведение. Для этого в файле conftest.py нужно задать функцию следующей сигнатуры:

```def compare_<имя решения без py>(exp: str, out: str, inp: str)```

На вход она получает эталонный ответ _exp_, ответ решения _out_, а также текст, который был на входе _inp_. В случае неверных решений должна выбрасывать `AssertionError`.

### Сравнение решений
При ML, TL если получается написать генератор заданий, то полезно перед отправкой сравнить неоптимальное решение и новое. Для этого функцию-генератор нужно поместить в _conftest.py_. Она не принимает параметров и возвращает конечный генератор строк-входных данных. Неоптимальное решение должно лежать в папке _attempts_.

Через консоль (без отладки): `yalgo run -с <имя_неоптималльного_решения> <имя_решения>`.

Если настроена отладка решений, то можно в _conftest.py_ задать значение переменной _errortaskname_. Тогда при дебаге будет запускаться сравнение решений.

Пример для задачи нахождения суммы двух чисел a и b, которые задаются через пробел:
```python
def gen_<имя решения без py>() -> Generator[str, None, None]:
    for _ in range(10):
        a, b = random.randint(1, 10), random.randint(1, 10)
        yield f'{a} {b}\n'
```

Пример запуска: `yalgo run -c A_ML_7 A`

## Использование api [contest.yandex.net](https://api.contest.yandex.net/api/public/swagger-ui.html)
Для автоматизации загрузки тестов и посылки решений нужно получить доступ к api. Для этого необходимо создать приложение с ЯндексID ([инструкция](https://admin.contest.yandex.ru/docs/ru/api-access)). **Важно**: перейти нужно по ссылке из инструкции, в поле "Доступ к данным" набрать _contest:submit_, в поле "Redirect url" _http://localhost:8080/callback_. В результате должны быть получены _client id_ и _client secret_.
### Автоматическое скачивание тестов при инициализации каталога
Необходимо скопировать url с путем к контесту в параметр --from-url и
```
yalgo init \
    --from-url "https://contest.yandex.ru/contest/<номер контеста>/..." \
    ...
```
- если не получали/протух токен:
```bash
    -p "client_id=<ваш client id>" \
    -p "client_secret=<ваш client secret>"
```
Должен открыться браузер, где необходимо разрешить доступ к контесту. После этого должен пройти редирект на localhost, где появится сообщение об успешном получении токена. Он сохранится в .cfg, будет подставляться автоматически.

- есть токен:
```bash
    -p "token=<ваш token>"
```

В будущем можно скопировать такой каталог, в git bash набрать `rm -r *` (удалятся все файлы, которые не начинаются с "."). Затем запустить `yalgo init --from-url ...` без других параметров, токен подтянется из конфига, конфиг будет перезаписан.

### Отправка решений
`yalgo send --help`

Необходима инициализация каталога при помощи --from-url. Также в файле .cfg необходимо проверить интерпретатор (python или pypy).

Если указать параметр -w <время в секундах>, будет сделано 10 попыток в течение этого времени для получения вердикта. В случае успеха выведется ОК, в случае неверного решения текущее рещение скопируется в папку attempts (если существует) с названием ошибки, номером теста и количеством попыток на этом тесте.
